# TODO: Регистрация пользователя (Done)
# TODO: Ограничение группам пользователей
# TODO: Группы пользователей
# TODO: -группа менеджеры
"""
-Добавить, удалить, изменить, просмотреть (только свои) Truck
-Добавить, удалить, изменить, просмотреть (только свои) Truck Type
-Добавить, удалить, изменить, просмотреть (только свой) Price Tag
-Добавить, удалить, изменить, просмотреть (только свой) Mover Price
-Добавить, удалить, изменить (только свои), просмотреть(свои и публичные) Inventory Collection
-Добавить, удалить, изменить (только свои), просмотреть(свои и публичные) Inventory
-Добавить, удалить, изменить, просмотреть (только свой) Calendar
"""
# TODO: Во все модели которые может писать пользователь добавить relation поле с юзером
# TODO: В каждой модели в которой предусмотренно публичный доступ на чтение необходимо сделать
#  флаг is_public default False
# TODO: Для каждого поля is_public сделать индексацию и не использовать ее в схеме Pydantic
# TODO: Просмотр, редактирование записи по id юзера
# TODO: Ввести таблицу company содержит: имя, админ
# TODO: Сделать тоже самое для Salerep
# TODO: -группа sales representative
"""
-Просматривать Inventory Collection
-Просматривать Calendar
"""